const year = prompt('Ваш рік народження?');

if (year === null) {
  alert('Шкода, що Ви не захотіли ввести свій(ю) дату народження');
}
const city = prompt('В якому місті ви живете?');
if (city === null) {
  alert('Шкода, що Ви не захотіли ввести свій(ю) місто');
}
const sport = prompt('Ващ вид спорту?');

if (sport === null) {
  alert('Шкода, що Ви не захотіли ввести свій(ю) вид спорту');
}

alert(
  `${year ? `Вік ${2023 - year}.` : ''}
${
  city ?
  (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон'
    ? `Ти живеш у столиці ${city}.`
    : `Tи живеш у місті ${city}.`) : ''
}
${
  sport === 'басектбол'
    ? 'Круто! Хочеш стати Владе Дівац?'
    : sport === 'бокс'
    ? 'Круто! Хочеш стати Девін Хейні?'
    : sport === 'футбол'
    ? 'Круто! Хочеш стати Ліонель Мессі?'
    : ''
}`
)


